hans-jorg/stm32f746g/X60-Ethernet/eth.c
/** Fields of BCR Register */
///@{
#define ETH_PHY_BCR_RESET                       (uint16_t) (0x8000)
#define ETH_PHY_BCR_LOOPBACK                    (uint16_t) (0x4000)
#define ETH_PHY_BCR_SPEED100MHz                 (uint16_t) (0x2000)
#define ETH_PHY_BCR_AUTONEGOTIATIONENABLE       (uint16_t) (0x1000)
#define ETH_PHY_BCR_POWERDOWN                   (uint16_t) (0x0800)
#define ETH_PHY_BCR_ISOLATE                     (uint16_t) (0x0400)
#define ETH_PHY_BCR_AUTONEGOTIATIONRESTART      (uint16_t) (0x0200)
#define ETH_PHY_BCR_FULLDUPLEX                  (uint16_t) (0x0100)
///@}

/* Fields of BSR Register */
///@{
#define ETH_PHY_BSR_100BASET_FULLDUPLEX         (uint16_t) (0x4000)
#define ETH_PHY_BSR_100BASET_HALFDUPLEX         (uint16_t) (0x2000)
#define ETH_PHY_BSR_10BASET_FULLDUPLEX          (uint16_t) (0x1000)
#define ETH_PHY_BSR_10BASET_HALFDUPLEX          (uint16_t) (0x0800)
#define ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED    (uint16_t) (0x0020)
#define ETH_PHY_BSR_AUTONEGOTEABILITY           (uint16_t) (0x0008)
#define ETH_PHY_BSR_LINKUP                      (uint16_t) (0x0004)
///@}

/* Fields of ISFR Register */
///@{
#define ETH_PHY_ISFR_INT8                       (uint16_t) (0x0100)
#define ETH_PHY_ISFR_INT7                       (uint16_t) (0x0080)
#define ETH_PHY_ISFR_INT6                       (uint16_t) (0x0040)
#define ETH_PHY_ISFR_INT5                       (uint16_t) (0x0020)
#define ETH_PHY_ISFR_INT4                       (uint16_t) (0x0010)
#define ETH_PHY_ISFR_INT3                       (uint16_t) (0x0008)
#define ETH_PHY_ISFR_INT2                       (uint16_t) (0x0004)
#define ETH_PHY_ISFR_INT1                       (uint16_t) (0x0002)
///@}

/* Fields of ISFR Register */
///@{
#define ETH_PHY_IMR_INT8                        (uint16_t) (0x0100)
#define ETH_PHY_IMR_INT7                        (uint16_t) (0x0080)
#define ETH_PHY_IMR_INT6                        (uint16_t) (0x0040)
#define ETH_PHY_IMR_INT5                        (uint16_t) (0x0020)
#define ETH_PHY_IMR_INT4                        (uint16_t) (0x0010)
#define ETH_PHY_IMR_INT3                        (uint16_t) (0x0008)
#define ETH_PHY_IMR_INT2                        (uint16_t) (0x0004)
#define ETH_PHY_IMR_INT1                        (uint16_t) (0x0002)
///@}

/* Fields of ANA Register */
///@{
#define ETH_PHY_ANA_100BASET_FULLDUPLEX         (uint16_t) (0x0100)
#define ETH_PHY_ANA_100BASET                    (uint16_t) (0x0080)
#define ETH_PHY_ANA_10BASET_FULLDUPLEX          (uint16_t) (0x0040)
#define ETH_PHY_ANA_10BASET                     (uint16_t) (0x0020)
#define ETH_PHY_ANA_SELDEFAULT                  (uint16_t) (0x0001)
#define ETH_PHY_ANA_ALL                         (uint16_t) (0x01E1)
///@}

/* Fields of SCSR Register */
///@{
#define ETH_PHY_SCSR_100BASET_FULLDUPLEX        (uint16_t) (0x0018)
#define ETH_PHY_SCSR_100BASET_HALFDUPLEX        (uint16_t) (0x0008)
#define ETH_PHY_SCSR_10BASET_FULLDUPLEX         (uint16_t) (0x0012)
#define ETH_PHY_SCSR_10BASET_HALFDUPLEX         (uint16_t) (0x0002)
#define ETH_PHY_SCSR_SPEED_M                    (uint16_t) (0x001C)
#define ETH_PHY_SCSR_AUTODONE                   (uint16_t) (0x1000)
#define ETH_PHY_SCSR_WRITEONE                   (uint16_t) (0x0040)
///@}

/**
 * @brief   Symbols for fields in MAC Address registers
 * 
 * @note    MAC Address #0 has a different format
 */
///@{
#define ETH_MACADDR_MBC_AE      (1<<31)
#define ETH_MACADDR_MBC_SA      (1<<30)
#define ETH_MACADDR_MBC_BYTE5   (1<<29)
#define ETH_MACADDR_MBC_BYTE4   (1<<28)
#define ETH_MACADDR_MBC_BYTE3   (1<<27)
#define ETH_MACADDR_MBC_BYTE2   (1<<26)
#define ETH_MACADDR_MBC_BYTE1   (1<<25)
#define ETH_MACADDR_MBC_BYTE0   (1<<24)
///@}



#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
/**
 * @brief   Flags for buffer initialization
 * 
 * @note    ETH_Init must run AFTER buffer initialization
 */
///@{
#define TXBUFFER_INITIALIZED            1
#define RXBUFFER_INITIALIZED            2

static uint8_t buffers_initialized = 0;
///@}
#endif



/**
 * @brief   small simple delay routine
 */

static void delay(int count) {
volatile int c = count;

    while( c-- ) {}

}


/*
 *
 * Inline functions for enabling/disabling modules/functions
 * 
 */



/**
 * @brief   Flush TX FIFO
 */
static inline void ETH_FlushTXFIFO(void) {

    ETH->DMAOMR = ETH_DMAOMR_FTF;

    delay(ETH_DELAY_AFTERFLUSH);

    return;
}


/**
 * @brief   ETH Enable/Disable Transmission DMA
 */
///@{
static inline void ETH_EnableTransmissionDMA(void) {

    ETH->DMAOMR |= ETH_DMAOMR_ST;
}

static inline void ETH_DisableTransmissionDMA(void) {

    ETH->DMAOMR &= ~ETH_DMAOMR_ST;
}
///@}


/**
 * @brief   ETH Enable/Disable Reception DMA
 */
///@{
static inline void ETH_EnableReceptionDMA(void) {

    ETH->DMAOMR |= ETH_DMAOMR_SR;
}

static inline void ETH_DisableReceptionDMA(void) {

    ETH->DMAOMR &= ~ETH_DMAOMR_SR;
}
///@}


/**
 * @brief   ETH Enable/Disable Transmission MAC
 */
///@{
static inline void ETH_EnableTransmissionMAC(void) {

    ETH->MACCR |= ETH_MACCR_TE;

    delay(ETH_DELAY_AFTERMAC);
}

static inline void ETH_DisableTransmissionMAC(void) {

    ETH->MACCR &= ~ETH_MACCR_TE;

    delay(ETH_DELAY_AFTERMAC);
}
///@}

/**
 * @brief   ETH Enable/Disable Reception MAC
 */
///@{
static inline void ETH_EnableReceptionMAC(void) {

    ETH->MACCR |= ETH_MACCR_RE;

    delay(ETH_DELAY_AFTERMAC);
}

static inline void ETH_DisableReceptionMAC(void) {

    ETH->MACCR &= ~ETH_MACCR_RE;

    delay(ETH_DELAY_AFTERMAC);
}
///@}



/**
 * @brief   WRITETOREG (Macro and Function)
 * 
 * @note    From  *STM32F74xxx STM32F75xxx Errata sheet: STM32F74xxx and
 *          STM32F75xxx device limitations*, "Successive write operations to 
 *          the same register might not be fully taken into account". 
 * 
 * @note    Register affected: ETH_DNABMR, ETH_DMAOMR, ETH_MACCR, ETH_MACFFR,
 *          ETH_MACHTHR, ETH_MACHTLR, ETH_MACFCR, ETH_MACVLANTR, ETH_MACRWUFFR,
 *          ETH_MACPMTCSR, ETH_MACA0HR, ETH_MACA0LR, ETH_MACA1HR, ETH_MACA1LR,
 *          ETH_MACA2HR, ETH_MACA2LR, ETH_MACA3HR, ETH_MACA3LR, ETH_PTPTSCR
 * 
 * 
 * @note    *Workaround 1*: Ensure a delay of four TX_CLK/RX_CLK clock cycles 
 *          between the successive write operations to the same register.
 *          *Workaround 2*: Make several successive write operations without 
 *          delay, then read the register when all the operations are 
 *          complete, and finally reprogram it after a delay of four
 *          TX_CLK/RX_CLK clock cycles
 *
 */
///@{
#define WRITETOREG(REG,VAL)                         \
                do {                                \
                    volatile uint32_t t;            \
                    t = VAL;                        \
                    REG = t;                        \
                    REG = t;                        \
                    __DSB();                        \
                    t = REG;                        \
                    delay(10);                      \
                    REG = t;                        \
                 } while(0)

static inline void WriteWithReg(volatile uint32_t *p, uint32_t val) {
volatile uint32_t t;

