hans-jorg/stm32f746g/X60-Ethernet/eth.c
    *p = val;
    *p = val;
    __DSB();
    t = *p;
    delay(10);
    *p = t;
}

////////////////// IRQ Handler /////////////////////////////////////////////////////////////////////

#ifdef ETH_USE_ETH_IRQ
/**
 * @brief   ETH interrupt handler
 * 
 * @note    Not tested yet!!!
 */

void ETH_IRQHandler(void) {

    // Check if a frame was received
    if( ETH->DMASR&ETH_DMASR_RS ) {
        /* Call back if defined */
        if( ETH_Callbacks.FrameReceived ) ETH_Callbacks.FrameReceived(0);
        ETH->DMASR = ETH_DMASR_RS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // Check if a frame was transmitted
    if( ETH->DMASR&ETH_DMASR_TS ) {
        /* Call back if defined */
        if( ETH_Callbacks.FrameTransmitted ) ETH_Callbacks.FrameTransmitted(0);
        ETH->DMASR = ETH_DMASR_TS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // ETH DMA Error (Abnormal Interrupt Summary)
    if( ETH->DMASR&ETH_DMASR_AIS ) {
        /* Call back if defined */
        if( ETH_Callbacks.ErrorDetected ) ETH_Callbacks.ErrorDetected(0);
        ETH->DMASR = ETH_DMASR_AIS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // Clear interrupt summary
    ETH->DMASR = ETH_DMASR_NIS;
}
#endif

////////////////// MAC Address Management //////////////////////////////////////////////////////////

/*
 * @brief   rev64
 *
 * @note    reverse byte order of a 64 bit integer
 */


static uint64_t rev64(uint64_t x) {
uint32_t xh,xl,xt;

    xt = (uint32_t) (x>>32);
    xl = __REV(xt);
    xt = (uint32_t) x;
    xh = __REV(xt);
    x = (((uint64_t) xh)<<32) | (uint64_t) xl;
    return x;

}

/**
 * @brief   Set Mac Address #0
 *
 * @note    The MAC address high register holds the upper 16 bits of the 6-byte 
 *          first MAC address of the station. Note that the first DA byte that 
 *          is received on the MII interface corresponds to the LS Byte 
 *          (bits [7:0]) of the MAC address low register. For example, if
 *          0x1122 3344 5566 is received (0x11 is the first byte) on the MII 
 *          as the destination address, then the MAC address register [47:0]
 *          is compared with 0x6655 4433 2211.
 */
void
ETH_SetMACAddress(uint64_t macaddr) {
uint64_t macaddr_rev;
const uint32_t mo = (1<<31);

    macaddr_rev = rev64(macaddr);

    WRITETOREG(ETH->MACA0HR,((uint32_t) (macaddr_rev>>32)&0xFFFF)|mo);
    WRITETOREG(ETH->MACA0LR,(uint32_t) (macaddr_rev));
}

/**
 * @brief   Set MAC Address #0 to #3
 *
 * @note    
 * 
 * @param   n: which MAC Address
 * @param   macaddr: 48-bit MAC Address in a 64-bit variable
 * @param   mbc: Mask byte control, source and address enable flag
 * 
 * @note    See 38.8.2 of RM
 */

void
ETH_SetMACAddressN(uint32_t n, uint64_t macaddr, uint32_t mbc) {
const uint32_t mo = (1<<31);
uint64_t macaddr_rev;

    macaddr_rev = rev64(macaddr);
    switch(n) {
    case 0:
        WRITETOREG(ETH->MACA0HR, ((uint32_t) (macaddr_rev>>32)&0xFF)|mo);
        WRITETOREG(ETH->MACA0LR,  (uint32_t) (macaddr_rev));
        break;
    case 1:
        WRITETOREG(ETH->MACA1HR, ((uint32_t) (macaddr>>32)&0xFF)|mbc);
        WRITETOREG(ETH->MACA1LR,  (uint32_t) (macaddr));
        break;
    case 2:
        WRITETOREG(ETH->MACA2HR, ((uint32_t) (macaddr>>32)&0xFF)|mbc);
        WRITETOREG(ETH->MACA2LR,  (uint32_t) (macaddr));
        break;
    case 3:
        WRITETOREG(ETH->MACA3HR, ((uint32_t) (macaddr>>32)&0xFF)|mbc);
        WRITETOREG(ETH->MACA3LR,  (uint32_t) (macaddr));
        break;
    }

}

/**
 * @brief   Get MAC Address #0 as a vector of bytes
 *
 * @note    Least significant byte first (CPU order)
 */
void
ETH_GetMACAddressAsVector(uint8_t macaddr[6]) {

    macaddr[0] = (ETH_MACADDRESS>>0)&0xFF;
    macaddr[1] = (ETH_MACADDRESS>>8)&0xFF;
    macaddr[2] = (ETH_MACADDRESS>>16)&0xFF;
    macaddr[3] = (ETH_MACADDRESS>>24)&0xFF;
    macaddr[4] = (ETH_MACADDRESS>>32)&0xFF;
    macaddr[5] = (ETH_MACADDRESS>>40)&0xFF;

}

/**
 * @brief   Get MAC Address #0 as a vector of bytes
 *
 * @note    Most significant byte first (Network order)
 */
void
ETH_GetMACAddressAsNetworkOrderedVector(uint8_t macaddr[6]) {

    macaddr[0] = (ETH_MACADDRESS>>40)&0xFF;
    macaddr[1] = (ETH_MACADDRESS>>32)&0xFF;
    macaddr[2] = (ETH_MACADDRESS>>24)&0xFF;
    macaddr[3] = (ETH_MACADDRESS>>16)&0xFF;
    macaddr[4] = (ETH_MACADDRESS>>8)&0xFF;
    macaddr[5] = (ETH_MACADDRESS>>0)&0xFF;

}

////////////////////////////////// Pin management //////////////////////////////////////////////////

#if ETH_USEGPIOFORCONFIGURATION == 1

/**
 * Configuration for ETH
 *
 *    | Board Signal | MCU Pin  |  AF  |  TRX Pin           | Description              |
 *    |--------------|----------|------|--------------------|--------------------------|
 *    | RMII_TX_EN   |  PG11    |  11  |  TXEN              | Transmit Enable          |
 *    | RMII_TXD0    |  PG13    |  11  |  TXD0              | Transmit Data 0          |
 *    | RMII_TXD1    |  PG14    |  11  |  TXD1              | Transmit Data 1          |
 *    | RMII_RXD0    |  PC4     |  11  |  RXD0/MODE0        | Receive Data 0           |
 *    | RMII_RXD1    |  PC5     |  11  |  RDD1/MODE1        | Receive Data 1           |
 *    | RMII_RXER    |  PG2     |   0  |  RXER/PHYAD0       | Receive Error            |
 *    | RMII_CRS_DV  |  PA7     |  11  |  CRS_DV/MODE2      | Carrier Sense/Data Valid |
 *    | RMII_MDC     |  PC1     |  11  |  MDC               | SMI Clock                |
 *    | RMII_MDIO    |  PA2     |  11  |  MDIO              | SMI Data Input/Output    |
 *    | RMII_REF_CLK |  PA1     |  11  |  nINT/REFCLK0      | 50 MHz REF_CLK           |
 *    | NRST         |          |      |  rRST              | Reset                    |
 *    | OSC_25M      |          |      |  XTAL1/CLKIN       |                          |
 *
 * NOTE: PG2 is used as a GPIO input. This is the default.
 */

static const GPIO_PinConfiguration pinconfig[] = {
/*
 *    | Parameter         |   Value   | Description              |
 *    |-------------------|-----------|--------------------------|
 *    | AF                |    11     | Alternate function ETH   |
 *    | Mode              |     2     | Alternate function       |
 *    | OType             |     0     | Push pull                |
 *    | OSpeed            |     3     | Very High Speed          |
 *    | Pull-up/Push down |     0     | No pull-up or push-down  |
 */
/*    GPIOx    Pin      AF  M  O  S  P  I */
   {  GPIOG,   11,      11, 2, 0, 3, 0, 0  },       // ETH_RMII_TXEN
   {  GPIOG,   13,      11, 2, 0, 3, 0, 0  },       // ETH_RMII_TXD0
   {  GPIOG,   14,      11, 2, 0, 3, 0, 0  },       // ETH_RMII_TXD1
   {  GPIOC,   4,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_RXD0
   {  GPIOC,   5,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_RXD1
   {  GPIOG,   0,       11, 0, 0, 3, 0, 0  },       // ETH_RMII_RXER     
   {  GPIOA,   7,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_CRS_DV
   {  GPIOC,   1,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_MDC
   {  GPIOA,   2,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_MDIO
   {  GPIOA,   1,       11, 2, 0, 3, 0, 0  },       // ETH_RMII_REFCLK
//
   {      0,   0,        0, 0,  0, 0, 0, 0 }        // End of List Mark
};

static void
ETH_ConfigurePins(void) {

    /* Configure pins from table*/
    GPIO_ConfigureMultiplePins(pinconfig);

