hans-jorg/stm32f746g/X60-Ethernet/eth.c
    SYSCFG->EXTICR1 =  (SYSCFG->EXTICR1&~SYSCFG_EXTICR1_EXT2_Msk)
                      |(SYSCFG_EXTICR1_EXTI2_PG);
}
#endif

/////////////////////////////////// Clock management ///////////////////////////////////////////////
/**
 * @brief ETH_EnableClock
 */
void ETH_EnableClock(uint32_t which) {

    // Enable PTP clock
    if( which&ETH_CLOCK_PTP )   RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACPTPEN;
    // Enable Ethernet MAC Reception clock
    if( which&ETH_CLOCK_MACRX ) RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACRXEN;
    // Enable Ethernet Transmission clock
    if( which&ETH_CLOCK_MACTX ) RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACTXEN;
    // Enable MAC clock address
    if( which&ETH_CLOCK_MAC )   RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACEN;

}

/**
 * @brief ETH_DisableClock
 */
void ETH_DisableClock(uint32_t which) {

    // Disable PTP clock
    if( which&ETH_CLOCK_PTP )   RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACPTPEN;
    // Disable Ethernet Reception clock
    if( which&ETH_CLOCK_MACRX ) RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACRXEN;
    // Disable Ethermet Trasmission clock
    if( which&ETH_CLOCK_MACTX ) RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACTXEN;
    // Disable MAC clock address
    if( which&ETH_CLOCK_MAC )   RCC->AHB1ENR &= ~RCC_AHB1ENR_ETHMACEN;

}


///////////////////////////// PHY management ///////////////////////////////////////////////////////


/**
 * @brief  ETH_WritePHYRegister
 */
static int ETH_WritePHYRegister( uint32_t reg, uint16_t val) {
uint32_t macmiiar = ETH->MACMIIAR;

    // Clear all fields except CR
    macmiiar &= ETH_MACMIIAR_CR_Msk;

    // Set PHY address
    macmiiar |= (ETH_PHY_ADDRESS<<ETH_MACMIIAR_PA_Pos);

    // Set PHY register
    macmiiar |= ((reg)<<ETH_MACMIIAR_MR_Pos);

    // Set operation to write
    macmiiar |= ETH_MACMIIAR_MW;

    // Wait until PHY is ready
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB ) {}  // TODO: Add timeout

    // Set data to be written
    ETH->MACMIIDR = val;


    // Set busy flag
    macmiiar |= ETH_MACMIIAR_MB;
    
    // Write operation
    ETH->MACMIIAR = macmiiar;

    // Test if it runs ok
    delay(10);
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB ) {}  // TODO: Add timeout

    return 0;
}


/**
 * @brief  ETH_ReadPHYRegister
 */
static int ETH_ReadPHYRegister( uint32_t reg, uint16_t *val) {
uint32_t macmiiar = ETH->MACMIIAR;

    // Set register to 0
    *val = 0;

    // Set data register to 0
    ETH->MACMIIDR = 0;

    // Clear all fields except CR
    macmiiar &= ETH_MACMIIAR_CR_Msk;

    // Set PHY address
    macmiiar |= (ETH_PHY_ADDRESS<<ETH_MACMIIAR_PA_Pos);

    // Set PHY register
    macmiiar |= ((reg)<<ETH_MACMIIAR_MR_Pos);

    // Set read operation
    macmiiar &= ~ETH_MACMIIAR_MW;

    // Wait until PHY is ready
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB  ) {}  // TODO: Add timeout

    // Set busy flag
    macmiiar |= ETH_MACMIIAR_MB;

    // Start read operation
    ETH->MACMIIAR = macmiiar;

    // Test if it runs ok
    delay(10);
    while( (ETH->MACMIIAR&ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB ) {}  // TODO: Add timeout

    // Read value
    *val = ETH->MACMIIDR;

    return 0;
}

/**
 * @brief  Configure PHY
 *
 * @note   PHY is Microchip LAN
 */

static int ETH_ConfigurePHY(void) {
uint16_t value;
int retries;
int configured = 0;

    MESSAGE("Entering ConfigurePHY\n");

    // Reset PHY
    ETH_WritePHYRegister(ETH_PHY_BCR,ETH_PHY_BCR_RESET);
    delay(ETH_DELAY_AFTERRESET*100);
    // Wait until Soft Reset bit self cleared
    do { 
        value = 0xFFFF;
        ETH_ReadPHYRegister(ETH_PHY_BCR,&value);
        delay(ETH_DELAY_AFTERRESET);
    } while ( value&ETH_PHY_BCR_RESET );

    // Configure Auto-Negotiation Advertisement Register
    // Should be done by MODE2_0 pins!!
    //ETH_WritePHYRegister(ETH_PHY_ANA,ETH_PHY_ANA_ALL);
    //delay(ETH_DELAY_BETWEENTESTS);

    // It this needed?
    //value &= ETH_PHY_BCR_LOOPBACK;

    // Wait until connected (linked)
    retries = ETH_RETRIES_LINK*100;
    do {
        value = 0;
        ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
        delay(ETH_DELAY_BETWEENTESTS);
    } while( (retries-->0)&&((value&ETH_PHY_BSR_LINKUP)==0) );

    // Configure using auto negotiation when connected
    if( (ETH_Config&ETH_CONFIG_AUTONEGOTIATE) && (value&ETH_PHY_BSR_LINKUP) ) {
        // Start autonegotiating
        ETH_WritePHYRegister(ETH_PHY_BCR,ETH_PHY_BCR_AUTONEGOTIATIONENABLE);
        delay(ETH_DELAY_AFTERREGISTERWRITE);
    
        // Wait until Auto Negotiation Completed
        retries = ETH_RETRIES_AUTONEGOTIATION;
        do {
            value = 0;
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            delay(ETH_DELAY_BETWEENTESTS);
        } while( (retries-->0)&&((value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED)==0) );

        if( (value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED)  ) {
            // Autonegotiation completed
            configured = 1;
        }           
    }
    if( ! configured ) {
        // Manual configuration
        ETH_ManualConfig();
        configured = 1;
    }
    // Update speed and connection in ConfigStatus
    ETH_UpdateConfigStatus();

    MESSAGEV("Link status = ***%s***\n",ETH_GetLinkInfoString());
    
    /*
     * This code sequence is identical to the one generated by
     * STM32CubeMX.
     * 
     * Since nINT not connected, PHY can not generate interrupts.
     * According LAN8742A datasheet, change of ISFR does not make sense,
     * because its fields are Read-Only.
     * 
     * But this register is vendor-specific. Maybe it does not work
     * following the datasheet.
     * 
     * From oryx-embedded.com
     * Any link failure condition is latched in the BMSR register. Reading
     * the register twice will always return the actual link status
     */
    #if 0
    // Enable interrupt on link status 
    ETH_ReadPHYRegister(ETH_PHY_ISFR,&value);
    value |= ETH_PHY_ISFR_INT4;
    ETH_WritePHYRegister(ETH_PHY_ISFR,value);
    // Read again to clear
    ETH_ReadPHYRegister(ETH_PHY_ISFR,&value);
    #endif

