hans-jorg/stm32f746g/X60-Ethernet/eth.c
    return 0;
}


/**
 * @brief   Reset ETH controller
 * 
 */
void ETH_Reset(void) {
int retries;
    // Reset ETH system
    ETH->DMABMR |= ETH_DMABMR_SR;
    // Wait until reset                     
    retries = 10;
    while( (retries--)&&((ETH->DMABMR&ETH_DMABMR_SR)) ) { 
        delay(100);
    }

}

/**
 * @brief   Find clock division encoding for SMI
 * 
 * @note    Find divisor of HCLK to generate the clock for the SMI channel
 * 
 * @note    The communication clock must be in the range 1.25-2.5 MHz
 *
/*
 * @note    Table used to set CR clock range to select MDC clock frequency
 *
 * @note    See description of CR field of MACMIIAR register in section 38.8.1 in RM.
 *
 * @note    The order is important. The index is used to configure field!!!
///@{ */
struct {
    uint32_t    minfreq;
    uint32_t    maxfreq;

} static cr_tab[] = {
    {   60000000,       100000000   },      // CR=000
    {  100000000,       150000000   },      // CR=001
    {   20000000,        35000000   },      // CR=010
    {   35000000,        60000000   },      // CR=011
    {  150000000,       216000000   },      // CR=100
    {          0,               0   }
};

static uint32_t findCREncoding(void) {
uint32_t hclkfreq;
int cr;

    hclkfreq = SystemGetHCLKFrequency();
    cr = 0;
    while( cr_tab[cr].minfreq
        && ( (hclkfreq < cr_tab[cr].minfreq)
            || (hclkfreq > cr_tab[cr].maxfreq)
           )
         ) {
        cr++;
    }
    return cr<<ETH_MACMIIAR_CR_Pos;

}
///@}


/**
 * @brief   Configure SMI
 * 
 * @note    Station Management Interface (SMI) is a serial communication
 *          channel providing control and configuration functions for  th
 *          PHY device
 * 
 * @note    It uses a synchronous serial communication with 2 wires: clock
 *          and data
 * 
 * @note    The clock frequency must be in the range 1.25-2.5 MHz 
 * 
 */
void ETH_ConfigureSMI(void) {

    // Configuring MDC CLock
    uint32_t cr = findCREncoding();
    ETH->MACMIIAR = (ETH->MACMIIAR&~ETH_MACMIIAR_CR_Msk)|cr;

}


/**
 * @brief   ETH ConfigureMAC
 *
 * @note    Configuring Media Access Control of the ETH Controller 
 * 
 * @note    MAC Registers
 * 
 *          * MACR: configuration register
 *          * MACFFR: frame filter register
 *          * MACHTHR: hash table high register
 *          * MACHTLR: hash table low register
 *          * MACMIIAR: MII (Media Independent Interface) address register
 *          * MACMIIDR: MII (Media Independent Interface) data register
 *          * MACFCR: flow control register
 *          * MACVLANTR: VLAN tag register
 *          * MACRWUFFR: remote wakeup frame filter register
 *          * MACPMRCSR: PMT (Power Management) control and status register
 *          * MACDBGR: debug register
 *          * MACSR: interrupt status register
 *          * MACIMR: interrupt mask register
 *          * MACA0HR: address 0 high register
 *          * MACA0LR: address 0 low register
 *          * MACA1HR: address 1 high register
 *          * MACA1LR: address 1 low register
 *          * MACA2HR: address 2 high register
 *          * MACA2LR: address 2 low register
 *          * MACA3HR: address 3 high register
 *          * MACA3LR: address 3 low register
 
 * 
 * @note    Configuration generated by STM32CubeMX
 * 
 *          * Watchdog enabled
 *          * Jabber enabled
 *          * Interframe gap set to 96
 *          * Carriersense enabled
 *          * Receive own enable
 *          * Loopback disabled
 *          * Checksum done by hardware
 *          * Retry transmission disabled
 *          * Automatic PAD CRC strip disabled
 *          * Backoff limit set to 10
 *          * Deferral check disabled
 *          * Receive all disabled
 *          * Source address filter disabled
 *          * Block all control frames
 *          * Broadcastframes reception_enabled
 *          * Destination filter normal
 *          * Promiscuous mode disabled
 *          * Multicast frames perfect
 *          * Unicast frames filter perfect
 *          * Zero quanta pause disabled
 *          * Pause low threshold set to -4
 *          * Unicast pause frame detect disabled
 *          * Receive flow control disabled
 *          * Transmit flow control disabled
 *
 */

static int ETH_ConfigureMAC(void) {

    /*************** MACCR: MAC Configuration Register ************************/

    volatile uint32_t maccr = ETH->MACCR;

    // Clear all fields
    maccr &= 0;

    // Configure
    // There are many fields with negative logic (1 to disable, 0 to enable)
    // No CRC stripping
    // Watchdog enable. Receive at most 2048 bytes
    // Jabber enable. Transmit at most 2048 bytes
    // Carrier sense active and generate error/abort transmission
    // Fast Ethernet will be set accordingly later
    // Receive own frames enabled!!!
    // No Loopback
    // Duplex mode will be set accordingly later
    // IPv4 checksum offload (ETH controller calculates CRC)
    // Retry enabled (based on BL)
    // No automatic pad/CRC stripping
    // Back-off limit = 10
    // No deferral check
    // Receiver and transmitter disabled, for now
    maccr |=     0
                |ETH_MACCR_IPCO         // Checksum by hardware
                |ETH_MACCR_IFG_96Bit    // Interframe gap = 96
                |ETH_MACCR_RD           // Retry disable = 1
                |ETH_MACCR_BL_10        // Backoff limit = min(n,4)
                ;

    // Set configuration for Fast Ethernet and Full Duplex, when possible
    if( ETH_ConfigStatus|ETH_CONFIGSTATUS_100BASET )
        maccr |= ETH_MACCR_FES;
    if( ETH_ConfigStatus&ETH_CONFIGSTATUS_FULLDUPLEX ) 
        maccr |= ETH_MACCR_DM;

    // Set configuration
    ETH->MACCR = maccr;
    maccr = ETH->MACCR;
    delay(20);
    ETH->MACCR = maccr;

    /*************** MACFFR: MAC Frame Filter Register ************************/

    volatile uint32_t macffr = ETH->MACFFR;

    // Clear all fields
    macffr  &= 0;

    // Configure
    // Receive all disabled
    // Perfect filter????
    // Source address filter disabled
    // Source address inverse filter disabled
    // Block all control frames
    // Broadcast frame enabled
    // Pass all multicast depends on Hash multicast bit
    // Destination address inverse filtering normal
    // Hash multicast perfect
    // No promiscuous mode
    macffr |=    0
                |ETH_MACFFR_PCF_BlockAll    // Block all control frames
                ;
    // Set configuration
    ETH->MACFFR = macffr;
    macffr = ETH->MACFFR;
    delay(ETH_DELAY_AFTERREGISTERWRITE);
    ETH->MACFFR = macffr;

    /*************** MACHTxR: Hash table high/low register ********************/

