hans-jorg/stm32f746g/X60-Ethernet/eth.c
    ETH->MACHTHR = 0;
    ETH->MACHTLR = 0;

    /*************** MACMIIAR: MII address register ***************************/
    // Used in ConfigurePHY

    /*************** MACMIIDR: MII data register ******************************/
    // Used in ConfigurePHY

    /*************** MACFCR: Flow control register ****************************/

    volatile uint32_t macfcr = ETH->MACFCR;

    // Clear all fields
    macfcr  &= 0;

    // Configure
    // pause time = 0
    // zero quanta pause at normal operation
    // pause low threshold set to Pause time - 4
    // unicast pause frame detect only for multicast address at 802.3 standard
    // receive flow control disabled
    // transmit flow control disabled
    // flow control ??

    macfcr |=    0
                |ETH_MACFCR_PLT_Minus4      // Pause low = Pause time - 4
                |ETH_MACFCR_ZQPD
                 ;

    // Set configuration
    ETH->MACFCR = macfcr;
    macfcr = ETH->MACFCR;
    delay(ETH_DELAY_AFTERREGISTERWRITE);
    ETH->MACFCR = macfcr;
    
    /*************** MACMVLANTR: VLAN tag register ****************************/

    volatile uint32_t macvlantr = ETH->MACVLANTR;

    // Clear all fields
    macvlantr &= 0;

    // Configure
    // 16 bit comparison
    // Tag = 0
    ETH->MACVLANTR  = macvlantr;
    macvlantr = ETH->MACVLANTR;
    delay(ETH_DELAY_AFTERREGISTERWRITE);
    ETH->MACVLANTR  = macvlantr;
    
    return 0;
}



/**
 * @brief   Configure DMA
 *
 * @note    Configurate DMA
 * 
 * @note    DMA Registers
 * 
 *          * DMAMBR: Bus mode register
 *          * DMATODR: Transmit poll demand register
 *          * DMARPDR: Receive poll demand register
 *          * DMARDLAR: Receive descriptor list address register
 *          * DMARDLAR: Transmit descriptor list address register
 *          * DMASR: Status register
 *          * DMAOMR: Operation mode register
 *          * DMAIER: Interrupt enable register
 *          * DMAMFBOCR: Missed frame and buffer overflow counter register
 *          * DMARSWTR: Receive status watchdog timer register
 *          * DMACHTDR: Current host transmit descriptor register
 *          * DMACHRDR: Current host receive descriptor register
 *          * DMACHRBAR: Current host transmit buffer address register
 *          * DMACHTBAR: Current host transmit buffer address register
 * 
 *
 * @note    Configuration generated by STM32CubeMX
 * 
 *          * Drop TCP/IP Frame on Checksum error enabled
 *          * Receive store forward enabled
 *          * Flush received frame enable
 *          * Transmit store forward enabled
 *          * Transmit threshold control set to 64 bytes
 *          * Forward error frames disabled
 *          * Forward undersized goodframes disabled
 *          * Received threshold control set to 64 bytes
 *          * Second frame operarted enabled
 *          * Address aligned beats enabled
 *          * Fixed burst_Enabled
 *          * Rx DMA burst length set to 32 beats
 *          * TxDMA burst length_set to 32 beats
 *          * DMA enhanced descriptor enabled
 *          * Descripto length set to 0x0;
 *          * DMA arbitration roundrobin RX/TX 1/1
 */

static int ETH_ConfigureDMA(void) {

    /*************** DMA Mode Register ****************************************/

    volatile uint32_t dmabmr = ETH->DMABMR;

    // Clear all fields
    dmabmr &= 0;

    // Configure
    // Fixed burst for length < 16
    // Address aligned beats enabled
    // PBL mode 4x disabled
    // Separate PBL (Programmable Burst Length) for Rx and TX
    // Rx DMA PBL (Programmable Burst Length)
    // Fixed burst enabled
    // Rx/Tx priority ratio = 1:1
    // Programmable Burst Length (PBL) = 32
    // Enhanced descriptor format enabled (IPv4 offload active)
    // Descriptor skip length = 0
    // DMA arbitration = round robin
    // Software

    dmabmr |=  ETH_DMABMR_AAB
              |ETH_DMABMR_USP
              |ETH_DMABMR_RDP_32Beat
              |ETH_DMABMR_FB
              |ETH_DMABMR_RTPR_1_1
              |ETH_DMABMR_PBL_32Beat
              |ETH_DMABMR_EDE
              ;

    // Configure DMABMR
    ETH->DMABMR = dmabmr;
    dmabmr = ETH->DMABMR;
    delay(ETH_DELAY_AFTERREGISTERWRITE);
    ETH->DMABMR = dmabmr;

    /*************** DMA Operation Mode Register ******************************/
    /*
     * It should be the last register to be configured.
     */
    volatile uint32_t dmaomr = ETH->DMAOMR;

    // clear fields
    dmaomr &= 0;

    // Configure
    // Drop frame with checksum error
    // Receive store and forward enabled
    // Enable flush of received framed
    // Transmit store and forward
    // Flush transmit FIFO (do not touch it yet!)
    // Transmit threshold control = 64 
    // Start/stop transmission (do not touch it yet!)
    // Forward error frames disabled
    // Forward undersized good frames disabled
    // Receive threshold control = 64
    // Operate on second frame enabled
    // Start/stop receive
    //
    // See Errata: Transmit frame data corruption (Set TSF=1!!!)

    dmaomr |= ETH_DMAOMR_RSF            // Receive and Store Forward
             |ETH_DMAOMR_TSF            // Transmit and Store Forward
             |ETH_DMAOMR_TTC_64Bytes    // Transmit threshold control
             |ETH_DMAOMR_RTC_64Bytes    // Receive threshold control
        //     |ETH_DMAOMR_OSF            // Operate on second frame
             ;
    // Configure DMAOMR
    ETH->DMAOMR = dmaomr;
    dmaomr = ETH->DMAOMR;
    delay(ETH_DELAY_AFTERREGISTERWRITE);
    ETH->DMAOMR = dmaomr;

    return 0;
}


/**
 * @brief   ETH_InitTXDescriptors
 *
 * @note    desc must be an array of DMA Descriptors
 *
 * @note    area must be at least count*ETH_TXBUFFER_SIZE
 *
 * @note    desc and area must be static!!!
 */

void ETH_InitTXDescriptors(ETH_DMADescriptor *desc, int count, uint8_t *area) {
int i;
uint32_t *a = (uint32_t *) area;

    ETH_TXDescriptors = desc;
    for(i=0;i<count;i++) {
        desc->Status    = ETH_TXDESC0_CHAINED | ETH_TXDESC0_CIC_BOTH_HW;
        __DSB();
        SCB_CleanDCache();
        desc->ControlBufferSize = ETH_TXBUFFERSIZE_INT8UNITS;
        desc->Buffer1Addr = (uint32_t) (a + i*ETH_TXBUFFERSIZE_INT32UNITS);
        desc->Buffer2NextDescAddr = (uint32_t) (ETH_TXDescriptors+((i+1)%count));
        desc->ExtendedStatus = 0; 
        desc->Reserved1 = 0;
        desc->TimeStampLow = 0;
        desc->TimeStampHigh = 0;
        desc++;
    }

    // Write table address to the ETH interface
    ETH->DMATDLAR = (uint32_t) ETH_TXDescriptors;

