hans-jorg/stm32f746g/X60-Ethernet/eth.c
#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    buffers_initialized |= TXBUFFER_INITIALIZED;
#endif

}

/**
 * @brief ETH_InitRXDescriptors
 *
 * @note  desc must be an array of DMA Descriptor
 *
 * @note  area must be count*ETH_TXBUFFER_SIZE
 *
 * @note  desc and area must be static!!!
 */


void ETH_InitRXDescriptors(ETH_DMADescriptor *desc, int count, uint8_t *area) {
int i;
uint32_t *a = (uint32_t *) area;

    ETH_RXDescriptors = desc;
    for(i=0;i<count;i++) {
        desc->ControlBufferSize = (ETH_RXBUFFER_SIZE<<ETH_RXDESC1_BUFFER1SIZE_POS) 
                                | ETH_RXDESC1_CHAINED 
                                | ETH_RXDESC1_DIC;
        desc->Buffer1Addr =  (uint32_t) (a + i*ETH_RXBUFFERSIZE_INT32UNITS);
        desc->Buffer2NextDescAddr = (uint32_t) (ETH_RXDescriptors+((i+1)%count));
        desc->ExtendedStatus = 0; 
        desc->Reserved1 = 0;
        desc->TimeStampLow = 0;
        desc->TimeStampHigh = 0;
        __DSB();
        desc->Status    = ETH_RXDESC0_OWN;
        __DSB();
        desc++;
    }

    // Write table address to the ETH interface
    ETH->DMARDLAR = (uint32_t) ETH_RXDescriptors;

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    buffers_initialized |= RXBUFFER_INITIALIZED;
#endif

}

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
/**
 * @brief ETH InitializeBuffers
 *
 * @note  Initialize all descriptors to point to buffers insided area
 *
 * @note  area must be aligned to a word address.]
 *
 * @note  area must have a size equal or largert to (ETH_TXBUFFER_COUNT*ETH_TXBUFFER_SIZE
 *   +ETH_RXBUFFER_COUNT*ETH_TXBUFFER_SIZE) bytes, with ETH_TXBUFFER_SIZE and ETH_RXBUFFER_SIZE
 *   multiple of sizeof(uint32_t)_
 */

void ETH_InitializeBuffers(char *area) {
uint32_t *a = (uint32_t *) area;

    ETH_InitTXDescriptors(ETH_TXDesc,ETH_TXBUFFER_COUNT,(uint8_t *) a);
    a += ETH_TXBUFFERSIZE_INT32UNITS *ETH_TXBUFFER_COUNT;
    ETH_InitRXDescriptors(ETH_RXDesc,ETH_RXBUFFER_COUNT,(uint8_t *) a);

}
#endif

/**
 * @brief   ConfigureMediaInterface
 * 
 * @note    This configuration must be done while the MAC is under reset and
 *          before enabling the MAC clocks. Since this is done using SYSCFG
 *          controller, its clock must be enabled first.
 */
static void ConfigureMediaInterface(void) {
uint32_t media = 1; // RMII PHY Interface

    // Enable SYSCFG clock to select the ethernet PHY interface to be used
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
    __NOP();
    __NOP();
    __DSB();

    //  Select RMII mode
    SYSCFG->PMC = (SYSCFG->PMC&~(SYSCFG_PMC_MII_RMII_SEL))
                 |(media<<SYSCFG_PMC_MII_RMII_SEL_Pos);
}

/**
 * @brief   ETH_Init
 *
 * @note    Initialize ETH controller
 * 
 * @note    When using dynamically allocated buffers, the must be
 *          registered before calling this function
 * 
 * @note    Initialization steps:
 * 
 *        * Setup buffers
 *        * Configure pins for ETH usage
 *        * Configure clocks
 *        * Reset ETH interface
 *        * Configure clock for serial communication
 *        * Configure PHY
 *        * Configure MAC
 *        * Configure DMA
 */

void ETH_Init(void) {

    MESSAGE("Entering ETH Init\n");

    // Reset callbacks
    ETH_Callbacks.ErrorDetected    = 0;
    ETH_Callbacks.FrameReceived    = 0;
    ETH_Callbacks.FrameTransmitted = 0;
    ETH_Callbacks.LinkStatusChanged= 0;

   // Enable clocks for ETH
    ETH_EnableClock(ETH_CLOCK_MAC|ETH_CLOCK_MACRX|ETH_CLOCK_MACTX);

     // Configure Media Interface
    ConfigureMediaInterface();

    // Configure pins
    ETH_ConfigurePins();

    MESSAGE("ETH Reset\n");
    // Soft Reset of the ETH Controller
    ETH_Reset();
 
#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    if( buffers_initialized != (RXBUFFER_INITIALIZED|TXBUFFER_INITIALIZED ) {
        while(1) {}
    }
#else
    ETH_InitTXDescriptors(ETH_TXDesc,ETH_TXBUFFER_COUNT,txbuffer);
    ETH_InitRXDescriptors(ETH_RXDesc,ETH_RXBUFFER_COUNT,rxbuffer);
#endif

    // Configure SMI
    ETH_ConfigureSMI();

    // Configuring PHY
    ETH_ConfigurePHY();

    // Clear the MAC configuration
    ETH_ConfigureMAC();

    // Configure DMA
    ETH_ConfigureDMA();

    // Configure MAC Address
    ETH_SetMACAddress(ETH_MACADDRESS);

#ifdef ETH_USE_ETH_IRQ
    // Configuring interrupt
    ETH->DMAIER |= (ETH_DMAIER_NISE|ETH_DMAIER_RIE);

    NVIC_SetPriority(ETH_IRQn,ETH_IRQLevel);
    NVIC_EnableIRQ(ETH_IRQn);
#endif
    MESSAGE("Exiting ETH Init\n");
}


/**
 * @brief   ETH Start
 *
 * @note    ETH_Init must be successfully called before
 */

void ETH_Start(void) {

    // Enable transmission
    ETH_EnableTransmissionMAC();

    // Start reception
    ETH_EnableReceptionMAC();

    // Flush FIFO
    ETH_FlushTXFIFO();

    // Enable transmission DMA
    ETH_EnableTransmissionDMA();

    // Enable reception DMA
    ETH_EnableReceptionDMA();

}

/**
 * @brief   ETH Stop
 */

void ETH_Stop(void) {

    // Disable reception DMA
    ETH_DisableReceptionDMA();

    // Disable transmission DMA
    ETH_DisableTransmissionDMA();

    // Flush FIFO
    ETH_FlushTXFIFO();

    // Stop transmission
    ETH_DisableTransmissionDMA();

    // Stop reception
    ETH_DisableReceptionDMA();
}



/**
 * @brief   ETH_ManualConfig
 * 
 * @note    Configure PHY using configuration in ETH_Config
 */

static void
ETH_ManualConfig(void) {
uint16_t value;

    MESSAGE("Entering manual configuration\n");
    value = 0;
    if( ETH_Config&ETH_CONFIG_FULLDUPLEX ) {
        if ( ETH_Config&ETH_CONFIG_100BASET )  {
            MESSAGE("100BASET FULL DUPLEX\n");
            value |= ETH_PHY_BCR_SPEED100MHz|ETH_PHY_BCR_FULLDUPLEX;
        } else if ( ETH_Config&ETH_CONFIG_10BASET ) {
            MESSAGE("10BASET FULL DUPLEX\n");
            value |= ETH_PHY_BCR_FULLDUPLEX;
        }
    } else if( ETH_Config&ETH_CONFIG_HALFDUPLEX ) {
        if ( ETH_Config&ETH_CONFIG_100BASET )  {
            MESSAGE("100BASET HALF DUPLEX\n");
            value |= ETH_PHY_BCR_SPEED100MHz;
        } else if ( ETH_Config&ETH_CONFIG_10BASET ) {
            MESSAGE("10BASET HALF DUPLEX\n");
            value |= 0;
        }
    }
    // Write config
    ETH_WritePHYRegister(ETH_PHY_BCR,value);
    delay(ETH_DELAY_AFTERCONFIG);

    MESSAGE("Exiting manual configuration\n");

