hans-jorg/stm32f746g/X60-Ethernet/eth.c
}


/**
 * @brief   Update configuration status when connected
 * 
 * @note    To be used when connecting
 * 
 * @returns 0 when link not up
 *          1  when configured by autonegotiation
 *          2  when configured manually
 * 
 * @note    ETH_Status is set according the speed and duplex mode 
 */
static void
ETH_UpdateConfigStatus(void) {
int configured = 0;
int retries = 0;
uint16_t value;
volatile uint32_t v;


    MESSAGE("Entering UpdateConfigStatus\n");

    // Turning off interrupts
    // Turn off TS trigger status by reading PTPRSSR
    v = ETH->PTPTSSR;
    // Turn off MMC tx ir by reading MMCTIR
    v = ETH->MMCTIR;

    // Get the result
    ETH_ReadPHYRegister(ETH_PHY_BSR,&value);

    if( (value&ETH_PHY_BSR_LINKUP) == 0 ) {
        ETH_ConfigStatus = ETH_CONFIGSTATUS_LINKDOWN;
        return;
    }
    ETH_ConfigStatus = ETH_CONFIGSTATUS_LINKUP;

    int status = ETH_GetLinkInfo();   
    
    // Set status
    switch(status) {
    case ETH_LINKINFO_100BASET_FULLDUPLEX:
        ETH_ConfigStatus |= ETH_CONFIG_100BASET;
        ETH_ConfigStatus |= ETH_CONFIG_FULLDUPLEX;
        MESSAGE(">100BASET Full Duplex\n");
        break;
    case ETH_LINKINFO_100BASET_HALFDUPLEX:
        ETH_ConfigStatus |= ETH_CONFIG_100BASET;
        ETH_ConfigStatus |= ETH_CONFIG_HALFDUPLEX;
        MESSAGE(">100BASET Half Duplex\n");
        break;
    case ETH_LINKINFO_10BASET_FULLDUPLEX:
        ETH_ConfigStatus |= ETH_CONFIG_10BASET;
        ETH_ConfigStatus |= ETH_CONFIG_FULLDUPLEX;
        MESSAGE(">10BASET Full Duplex\n");
        break;
    case ETH_LINKINFO_10BASET_HALFDUPLEX:
        ETH_ConfigStatus |= ETH_CONFIG_10BASET;
        ETH_ConfigStatus |= ETH_CONFIG_HALFDUPLEX;
        MESSAGE(">10BASET Half Duplex\n");
        break;
    }

    // Set MAC configuration for Fast Ethernet and Full Duplex
    uint32_t maccr = ETH->MACCR;
    maccr &= ~(ETH_MACCR_FES|ETH_MACCR_DM);
    if( ETH_ConfigStatus&ETH_CONFIG_100BASET )   maccr |= ETH_MACCR_FES;
    if( ETH_ConfigStatus&ETH_CONFIG_FULLDUPLEX ) maccr |= ETH_MACCR_DM;
    ETH->MACCR = maccr;


    MESSAGEV("Link status = %3s  ",status?"On":"Off");
    MESSAGEV("Rx DMA: %3s  ", (ETH->DMAOMR&ETH_DMAOMR_ST) ?"On":"Off" );
    MESSAGEV("Tx DMA: %3s  ", (ETH->DMAOMR&ETH_DMAOMR_SR) ?"On":"Off" );

    MESSAGEV("Rx MAC: %3s  ", (ETH->MACCR&ETH_MACCR_RE) ?"On":"Off" );
    MESSAGEV("Tx MAC: %3s\n", (ETH->MACCR&ETH_MACCR_TE) ?"On":"Off" );


    
    MESSAGE("Exiting UpdateConfigStatus\n");
}




/**
 * @brief   UpdateLinkStatus
 * 
 * @note    It must be called when there is a change in link status
 */
int
ETH_UpdateLinkStatus(void) {
int configured = 0;
int retries = 0;
uint16_t value;

    MESSAGE("Entering UpdateLinkStatus\n");

    uint32_t v = ETH->DMAOMR;
    v &= (ETH_DMAOMR_SR|ETH_DMAOMR_ST);
    MESSAGEV("Operation mode = %04x (TFINISHED=01,TSTOPPED=02,RS=20)\n",v);
    v = ETH->MACCR;
    v &= (ETH_MACCR_TE|ETH_MACCR_RE);
    MESSAGEV("MAC mode = %04x (TE=8,RE=4)\n",v);

    if( ETH_Config&ETH_CONFIG_AUTONEGOTIATE ) {
        MESSAGE("Autonegotiation\n");
        // Autonegotiate set
        retries = ETH_RETRIES_LINK*100;
        do {
            value = 0;
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            delay(ETH_DELAY_BETWEENTESTS);
            retries--;
        } while ((retries>0)&&(value&ETH_PHY_BSR_LINKUP)!=ETH_PHY_BSR_LINKUP);

        if( (value&ETH_PHY_BSR_LINKUP) == 0 ) {
            // Not connected
            MESSAGE("Link down. Not connected?\n");
            configured = 0;
            goto end;
        }

        if( (value&ETH_PHY_BSR_AUTONEGOTEABILITY) == 0 ) {
            MESSAGE("Link down. Not connected?\n");
            configured = 0;
        } else {
            MESSAGE("Starting Autonegotiation: ");
            // Configure Autonegotiate
            ETH_WritePHYRegister(   ETH_PHY_BCR,
                                    ETH_PHY_BCR_AUTONEGOTIATIONRESTART
                                    );
            delay(ETH_DELAY_AFTERAUTONEGOTIATION);
            retries = ETH_RETRIES_AUTONEGOTIATION*10;
            do {
                value = 0;
                delay(ETH_DELAY_BETWEENTESTS*100);
        //       ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
                ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
                __DSB();
            } while(    (retries-->0)
                    && ((value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED)==0) );

            if( value&ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED ) {
                MESSAGE("Success\n");
                // Update config status
                ETH_UpdateConfigStatus();
                configured = 1;
            } else {
                MESSAGE("Failed\n");
                configured = 0;
            }
        }
    }
    if( ! configured ) {
        MESSAGE("Manual configuration\n");
        // Autonegotiation not set or not working
        // Configure Speed and Duplex Mode
        ETH_ManualConfig();

        ETH_UpdateConfigStatus();
        configured = 2;
    }

end:

    // Post configuration actions
    MESSAGE("Exiting UpdateLinkStatus\n");

    return configured;

}

///@}
/**
 * @brief   Transmit data already in DMA buffer 
 * 
 * @note    size must be smaller or equal to ETH_TXBUFFER_SIZE*ETH_MAX_PACKET_SIZE
 * 
 * @note    It uses a default (non OSF) mode, i.e., only one frame beeing
 *          transmitted
 *
 * @note    Buffer can only be modified when there is no TX DMA operation running
 *
 * @note    Procedure to transmit a multiple buffer frame
 *
 *          1. Wait until descriptors are free (OWN=0)
 *          2. Copy the data to the DMA buffers
 *          3. Adjust descriptors flags
 *          4. Set OWN bit in all descriptors
 *          3. Set ST bit in DMAOMR to make DMA enter in Run state
 *    Copy data to transmission device (send it!)
 *          4.    If not the last one, get next descriptor
 *          5. Until all data is transmitted (No more descriptors with OWN bit set) or
 *             a descriptor has the LS bit set.

