hans-jorg/stm32f746g/X60-Ethernet/eth.c
 *          7. Set ST bit in DMAOMR register to start the DMA transmit engine*
 * 
 * @note    To resume operation, write something to DMATPDR
 *
 */

void PrintDMAStatus(uint32_t which) {
uint32_t v;

    v = ETH->DMASR;

    printf("Common section\n");
    printf("Time stamp trigger        = %d\n",(v>>ETH_DMASR_TSTS_Pos)&0x1);
    printf("PMT status                = %d\n",(v>>ETH_DMASR_PMTS_Pos)&0x1);
    printf("MMCS status               = %d\n",(v>>ETH_DMASR_MMCS_Pos)&0x1);

    if( which&1 ) {
        printf("Transmit section\n");
        printf("Transmit process state    = %d\n",(v>>ETH_DMASR_TPS_Pos)&0x7);
        printf("Transmit status           = %d\n",(v>>ETH_DMASR_TS_Pos)&0x1);
        printf("Transmit stopped status   = %d\n",(v>>ETH_DMASR_TPSS_Pos)&0x1);
        printf("Transmit buffer status    = %d\n",(v>>ETH_DMASR_TBUS_Pos)&0x1);
        printf("Transmit underflow status = %d\n",(v>>ETH_DMASR_TUS_Pos)&0x1);
        printf("Early transmit status     = %d\n",(v>>ETH_DMASR_ETS_Pos)&0x1);
        printf("Fatal bus error           = %d\n",(v>>ETH_DMASR_FBES_Pos)&0x1);
        printf("Abnormal interrupt        = %d\n",(v>>ETH_DMASR_AIS_Pos)&0x1);
        printf("Error by Tx DMA           = %d\n",(v>>23)&0x1);
        printf("Error by read             = %d\n",(v>>24)&0x1);
        printf("Error in descriptor       = %d\n",(v>>25)&0x1);

        printf("Descriptor #0             = %08X\n",ETH->DMATDLAR);
        printf("Current descriptor        = %08X\n",ETH->DMACHTDR);
        printf("Current buffer            = %08X\n",ETH->DMACHTBAR);
        printf("Start transmission        = %d\n",!!(ETH->DMAOMR&ETH_DMAOMR_ST));

    }    
    if( which&2 ) {
        printf("Receive section\n");
        printf("Receive process state     = %d\n",(v>>ETH_DMASR_RPS_Pos)&0x7);
        printf("Receive status            = %d\n",(v>>ETH_DMASR_RS_Pos)&0x1);
        printf("Receive buffer status     = %d\n",(v>>ETH_DMASR_RBUS_Pos)&0x1);
        printf("Receive overflow status   = %d\n",(v>>ETH_DMASR_ROS_Pos)&0x1);
        printf("Early Receive status      = %d\n",(v>>ETH_DMASR_ERS_Pos)&0x1);
        printf("Fatal bus error           = %d\n",(v>>ETH_DMASR_FBES_Pos)&0x1);
        printf("Abnormal interrupt        = %d\n",(v>>ETH_DMASR_AIS_Pos)&0x1);
        printf("Error by Rx DMA           = %d\n",!((v>>23)&0x1));
        printf("Error by write            = %d\n",!((v>>24)&0x1));
        printf("Error in buffer           = %d\n",!((v>>25)&0x1));

        printf("Descriptor #0             = %08X\n",ETH->DMARDLAR);
        printf("Current descriptor        = %08X\n",ETH->DMACHRDR);
        printf("Current buffer            = %08X\n",ETH->DMACHRBAR);
        printf("Start reception           = %d\n",!!(ETH->DMAOMR&ETH_DMAOMR_SR));

    }    

}

int
ETH_TransmitFrame(ETH_DMADescriptor *desc, unsigned size) {
int nbuffers,lastbuffersize;

    MESSAGE("Entering ETH_TransmitFrame\n");

    if( size == 0 )
        return 0;

    // Disable transmission (Temporary fix)
    ETH_DisableTransmissionDMA();

    ETH->DMASR = 0x0000E7FF; // clear all flags

    desc = ETH_TXDescriptors;
    // Check OWN bit in the first descriptor. If it is set, DMA is using it
    if( (desc->Status&ETH_TXDESC0_OWN) != 0 ) {
        return -1;      // BUSY!!!!!!
    }

    nbuffers = size/ETH_TXBUFFER_SIZE;
    lastbuffersize = size%ETH_TXBUFFER_SIZE;
    if( lastbuffersize != 0 ) nbuffers++;

    MESSAGEV("nbuffers=%d size=%d\n",nbuffers,size);
        
    if( nbuffers == 1 ) {
        // Configure first and only descriptor
        MESSAGE("Only one packet\n");
        desc->Status |= ETH_TXDESC0_FIRST|ETH_TXDESC0_LAST;
        desc->ControlBufferSize = lastbuffersize&ETH_TXDESC1_BUFFER1SIZE_MSK;
        __DSB();
        desc->Status |= ETH_TXDESC0_OWN;
        __DSB();
    } else {
        // Configure first descriptor
        MESSAGE("First packet\n");
        desc->Status = (desc->Status&~ETH_TXDESC0_LAST)|ETH_TXDESC0_FIRST;
        desc->ControlBufferSize = ETH_TXBUFFER_SIZE&ETH_TXDESC1_BUFFER1SIZE_MSK;
        desc = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
        // Must be set after the others
        //desc->Status |= ETH_TXDESC0_OWN;

        // Configure intermediate descriptors
        for(int i=1;i<nbuffers-1;i++) {
            MESSAGE("Middle packet\n");
            desc->Status  &= ~(ETH_TXDESC0_FIRST|ETH_TXDESC0_LAST);
            desc->ControlBufferSize = ETH_TXBUFFER_SIZE&ETH_TXDESC1_BUFFER1SIZE_MSK;
            desc = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
            desc->Status |= ETH_TXDESC0_OWN;
        }
        // Configure last descriptor
        MESSAGE("Last packet\n");
        desc->Status = (desc->Status&~ETH_TXDESC0_FIRST)|ETH_TXDESC0_LAST;
        desc->ControlBufferSize = lastbuffersize&ETH_TXDESC1_BUFFER1SIZE_MSK;
        desc->Status |= ETH_TXDESC0_OWN;

        // Own bit of first descriptor must be set last
        __DSB();
        ETH_TXDescriptors->Status |= ETH_TXDESC0_OWN;
        __DSB();
    }

    MESSAGEV("Status=%08X\n",ETH_TXDescriptors->Status);

    // Check Transmit buffer status
    // To resume processing transmit descriptors, the host should change
    // the ownership of the bit of the descriptor and then issue a Transmit
    // Poll Demand command.
    // Make all data in CPU to be written into memory
    // Clear it and start transmission
  
    if( ETH->DMASR&ETH_DMASR_TBUS ) {
        ETH->DMASR = ETH_DMASR_TBUS;        // Clear
        ETH->DMATPDR = 0;                   // Transmit poll demand
    }

    ETH_EnableTransmissionDMA();

    MESSAGE("Testing if transmitted\n");
    int retries = 100;
    do {
        delay(10);
        MESSAGE("+");
    } while( (retries-->0) && ((ETH_TXDescriptors->Status&ETH_TXDESC0_OWN)!=0) );
    MESSAGEV("%s\n",retries?"Done":"Failed");

    MESSAGE("Exiting ETH_TransmitFrame\n");
    return 0;
}



/**
 * @brief   Receive data
 *
 * @note    Check if there is data in buffers and sets an indicator
 *
 * @note    Procedure to receive a multiple buffer frame
 *
 *       1.  Setup receive descriptors
 *       2.  Set OWN bit
 *       3.  Set bit SR in DMAOMR register to start the DMA receive engine
 *       4.  Repeat
 *             Receive data and store it into the buffer pointed by descriptor
 *             Write the first word (+0 offset) with OWN bit cleared and flags set
 *       5.  Until the last segment is received or the descriptor list does not have
 *           descriptors for the DMA engine, i.e,with OWN bit set.
 *
 * @note    To resume operation or force the scan of the descriptor list, a value 
 *          must be written to the DMA
 *
 * @note    Frame length field in Rx Descriptors indicates the byte length of 
 *          the received frame that was transferred to host memory 
 *          (including CRC). This field is valid only when last descriptor 
 *          (RDES0[8]) is set and descriptor error (RDES0[14]) is reset.
 *          When the last descriptor and error summary bits are not set, this 
 *          field indicates the accumulated number of bytes that have been
 *          transferred for the current frame.
 * 
 * @note    All buffers will use the maximum size, except the last one. One must 
 *          get the FL field to get the size of the data in the last buffer.
 */

int
ETH_ReceiveFrame(ETH_DMAFrameInfo *RxFrameInfo) {
int size;
int len;
ETH_DMADescriptor *desc,*descfirst;
uint32_t status;
int first;
int rc = 0;

    // Clean RxFrameInfo
    RxFrameInfo->SegmentCount = 0;
    RxFrameInfo->FirstSegmentDesc = 0;
    RxFrameInfo->LastSegmentDesc = 0;
    RxFrameInfo->FrameLength = 0;

    MESSAGE("Entering ETH_ReceiveFrame\n");

    PrintDMAStatus(2);


