hans-jorg/stm32f746g/X60-Ethernet/eth.c
    ETH_EnableReceptionDMA();

    // Searching for First segment
    desc = ETH_RXDescriptors;/*  */
    status = desc->Status;
    first = 0;
    do {
        uint32_t x = (status&ETH_RXDESC0_OWN)?1:0;
        message("Processing descriptor at %p (own=%d). ",desc,x);
        first = ((status&ETH_RXDESC0_OWN)==0)&&((status&ETH_RXDESC0_FIRST)!=0);
        if( first ) {
            // found a first segment
            break;
        }
        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        message("Next is %p\n",desc);
        status = desc->Status;
    } while ( desc != ETH_RXDescriptors );


    if( !first ) {
        MESSAGE("A first segment not found\n");
        rc = -1;
        goto err;
    }

    MESSAGE("Found a first segment\n");
    descfirst = desc;
    status = desc->Status;

    while( (status&ETH_RXDESC0_OWN) == 0 )  {
        message("processing descriptor at %p\n",desc);
        size = (desc->ControlBufferSize&ETH_RXDESC1_BUFFER1SIZE_MASK)>>ETH_RXDESC1_BUFFER1SIZE_POS;
        len  = (desc->Status&ETH_RXDESC0_FRAMELENGTH_MASK)>>ETH_RXDESC0_FRAMELENGTH_POS;
        if( (status&ETH_RXDESC0_FIRST) && (status&ETH_RXDESC0_LAST) ) {
            MESSAGE("Received only one frame\n");
           // Only one buffer
            RxFrameInfo->FirstSegmentDesc = desc;
            RxFrameInfo->LastSegmentDesc  = desc;
            RxFrameInfo->SegmentCount = 1;
            RxFrameInfo->FrameLength = (len-4);      // exclude CRC
            rc = 1;
            break;
        } else if ( status&ETH_RXDESC0_FIRST ) {
            MESSAGE("Received first frame\n");
            // first buffer
            RxFrameInfo->FirstSegmentDesc = desc;
            RxFrameInfo->LastSegmentDesc  = 0;
            RxFrameInfo->SegmentCount = 1;
            RxFrameInfo->FrameLength = (len-4);
        } else if ( status&ETH_RXDESC0_LAST )  {
            MESSAGE("Received last frame\n");
            // last buffer
            RxFrameInfo->LastSegmentDesc  = desc;
            RxFrameInfo->SegmentCount++;
            RxFrameInfo->FrameLength+= (len-4);     // exclude CRC
            rc = 1;
            break;
        } else {
            MESSAGE("Received middle frame\n");
            // intermediary
            RxFrameInfo->SegmentCount++;
            RxFrameInfo->FrameLength = (len-4);
        }
        MESSAGE("Next\n");
        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        // Test if it returned to the start
        if( desc == descfirst )
            break;
        status = desc->Status;
    }

err:
    ETH_EnableReceptionDMA();

    desc = RxFrameInfo->FirstSegmentDesc;
    MESSAGEV("FrameInfo: count=%1d size=%1d\n",
        RxFrameInfo->SegmentCount,
        RxFrameInfo->FrameLength);
    for(int i=0;i<RxFrameInfo->SegmentCount;i++) {
        MESSAGEV("Segment #%1d: Descriptor=%08X Buffer=%08X Length=%1d\n",
            i,
            desc,
            desc->Buffer1Addr,
            (desc->ControlBufferSize&ETH_RXDESC1_BUFFER1SIZE_MASK)>>ETH_RXDESC1_BUFFER1SIZE_POS);
            desc = (ETH_DMADescriptor *)  desc->Buffer2NextDescAddr;
    }
    MESSAGE("Exiting ETH_ReceiveFrame\n");

    return rc;
}


/**
 * @brief   Check if a frame has been received
 *
 * @note    Specially the last buffer must have been received
 *
 */
int
ETH_CheckReception(void) {
ETH_DMADescriptor *desc;
uint32_t SegmentCount = 0;

    desc = ETH_RXDescriptors;

    SegmentCount = 0;
    while(desc) {
        if( (desc->Status&ETH_RXDESC0_OWN) != 0 )  {
            return 0;
        }

        if( (desc->Status&ETH_RXDESC0_FIRST) && (desc->Status&ETH_RXDESC0_LAST) ) {
            // Only one buffer
            SegmentCount = 1;
            return 1;
        } else if( desc->Status&ETH_RXDESC0_FIRST ) {
            // First buffer
            SegmentCount = 1;
        } else if ( desc->Status&ETH_RXDESC0_LAST ) {
            // Last buffer
            SegmentCount++;
            return 1;
        } else {
            // Middle buffer
            SegmentCount++;
        }
        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        // Test if it returned to the start
        if( desc == ETH_RXDescriptors )
            break;
    }
    return 0;
}

////////////////// Status Functions /////////////////////////////////////////////////////////////

/**
 * @brief  Check link status and return if it up (connected)
 * 
 * @return int 
 */
int  ETH_IsConnected(void) {
int retries = ETH_RETRIES_LINK;
uint16_t value;

    value = 0;
    do {
        ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
        delay(ETH_DELAY_BETWEENTESTS);
    } while((retries-->0)&&((value&ETH_PHY_BSR_LINKUP)==0));

    message("Connected = %04X\n",value);
    value = (value&ETH_PHY_BSR_LINKUP)!=0;
    return value ;
}

/**
 * @brief   Check if link is up;
 * 
 * @brief   Alias for IsConnected
 * 
 * @return int 
 */
int  ETH_IsLinkUp(void) {

    return ETH_IsConnected();
}



/**
 * @brief   Return link status
 * 
 * @brief   Returns a merge of BCR and BSR registers of PHY
 * 
 * @return  higher 16 bits contains BCR and the lower 16 bits, BSR 
 */
unsigned ETH_GetLinkStatus(void) {
uint16_t bcr,bsr;

    ETH_ReadPHYRegister(ETH_PHY_BCR,&bcr);
    delay(ETH_DELAY_BETWEENTESTS);

    ETH_ReadPHYRegister(ETH_PHY_BSR,&bsr);
    delay(ETH_DELAY_BETWEENTESTS);

    return  (((uint32_t) bcr)<<16) | ((uint32_t) bsr);
}

///////////////// Register callback functions ////////////////////////////////////////////////////

/**
 * @brief   Register Callback functions
 *
 * @note    To unregister, set pointer to 0 or NULL
 */
void ETH_RegisterCallback(unsigned which, void (*pFunction)(unsigned) ) {

    switch(which) {
    case ETH_CALLBACK_FRAMERECEIVED:
        ETH_Callbacks.FrameReceived     = pFunction;
        break;
    case ETH_CALLBACK_FRAMETRANSMITTED:
        ETH_Callbacks.FrameTransmitted  = pFunction;
        break;
    case ETH_CALLBACK_ERRORDETECTED:
        ETH_Callbacks.ErrorDetected     = pFunction;
        break;
    case ETH_CALLBACK_LINKSTATUSCHANGED:
        ETH_Callbacks.LinkStatusChanged = pFunction;
    }

    return;
}

struct pyregisternames {
    int     index;
    char *  name;
} regtable[] = {
  {  0, "Basic Control" },
  {  1, "Basic Status" },
  {  2, "PHY Identifier 1" },
  {  3, "PHY Identifier 2" },
  {  4, "Auto Negotiation Advertisement" },
  {  5, "Auto Negotiation Partner Ability" },
  {  6, "Auto Negotiation Expansion" },
  {  7, "Auto Negotiation Next Page TX" },
  {  8, "Auto Negotiation Next Page RX" },
  { 13, "MMD Access Control" },
  { 14, "MMD Access Address/Data" },
  { 16, "EDPD NLP/Crossover Time*" },
  { 17, "Mode Control/Status*" },
  { 18, "Special Modes*" },
  { 24, "TDR Patterns/Delay Control*" },
  { 25, "TDR Control/Status*" },
  { 26, "Symbol Error Counter*" },
  { 27, "Special Control/Status Indications*" },
  { 28, "Cable Length*" },
  { 29, "Interrupt Source Flag*" },
  { 30, "Interrupt Mask*" },
  { 31, "PHY Special Control/Status" },
  { 0,  0 } /* END MARKER */
};

void ETH_PHYRegisterDump(void) {
struct pyregisternames *p = regtable;
uint16_t value;
#if 1
    while( p->name ) {
        ETH_ReadPHYRegister(p->index,&value);
        message("%35s: %04X\n",p->name,value);
        p++;
    }
#endif
}


/**
 * @brief   ETH_GetLinkInfo
 * 
 * @note    returns the link info
 * 
 */

static char const *linkinfo[] = {
    /* 000 */       "Not connected ?",
    /* 001 */       "10BaseT Half Duplex",
    /* 010 */       "100BaseT Half Duplex",
    /* 011 */       "Not connected?",
    /* 100 */       "Not connected ?",
    /* 101 */       "10BaseT Full Duplex",
    /* 110 */       "100BaseT Full Duplex",
    /* 111 */       "Not connected"
};

int
ETH_GetLinkInfo(void) {
uint16_t value;

    ETH_ReadPHYRegister(ETH_PHY_SCSR,&value);

    value >>= 2;
    value &= 0x7;
    return value;
}

char const *
ETH_GetLinkInfoString(void) {
uint16_t value;

    value = ETH_GetLinkInfo();
    return linkinfo[value];
}


/**
 * @brief   ETH_DumpDescriptors
 * 
 * @param   which= 1:TX Descriptors, 2:RX Descriptors, 3: Both
 */
void ETH_DumpDescriptors(uint32_t which) {
ETH_DMADescriptor *desc,*next;
char *buffer;

    if( which&1 ) {
        desc = ETH_TXDescriptors;
        do {
            next = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
            buffer = (char *) (desc->Buffer1Addr);
            message("TX descriptor @ %p: status=%08X next=%p buffer=%p\n",
                    desc,desc->Status,next,buffer);
            desc = next;
        } while ( desc != ETH_TXDescriptors );
    }
    if( which&2 ) {
        desc = ETH_RXDescriptors;
        do {
            next = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
            buffer = (char *) (desc->Buffer1Addr);
            message("RX descriptor @ %p: status=%08X next=%p buffer=%p\n",
                    desc,desc->Status,next,buffer);
            desc = next;
        } while ( desc != ETH_RXDescriptors );
    }
}